{
  "main": {
    "name":"Andy (Xiang-Yu) Cui",
    "occupation":"  5 Years PM with software experience, 2 years Machine learing Engineer and 1 year Full Stack Engineer.",
    "description":"Full stack design Sale System By NodeJs",
    "image":"profilepic.jpg",
    "intro":"Data Analyst | CAC Auto Group Boston | H1B Actived. ",
    "bio":"Integrating state-of-the-art design and development practices, I specialize in creating robust Machine Learning, back-end, and front-end applications, having delivered multifaceted projects across diverse domains. My technical toolkit is comprehensive, encompassing Java, Python, MySQL, PostgreSQL, AWS, React.js, and adept implementation of CI/CD pipelines. Mastering complex problem-solving, I am a self-driven technophile, relentlessly chasing the latest technological breakthroughs. As a fervent learner in Machine Learning and Natural Language Processing, I am particularly captivated by the prospects of mining cutting-edge big data and transforming it into insightful visual representations.",
    "skills": [
      "Programing languages: Java, Python, JavaScript, HTML, CSS, C/C++, Assembly, VB",
      "Database: MySQL, PostgreSQL, MongoDB, Redis, SQLite, Hive",
      "Machine Learning: TF-IDF, Naïve Bayes, GPT-2, Bert, CNN, Transformer",
      "Framework/Libraries: Spring Boot, React.js, Node.js, jQuery",
      "Version Control & CI/CD: GitHub, TFS, Azure DevOps, Jenkins, Jira",
      "Others: AWS, Docker, Maven, Tomcat, Axure RP, Servlet, Junit, Nginx, LaTeX, CAD design, Tableau"
    ],
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "xiangyucui@outlook.com  cui.xiangyu@northeastern.edu",
    "phone": "(402)-853-3000",
    "city":"Boston",
    "nameUnderImage": "Andy    Cui",
    "address":{
      "street":"",
      "city":"Boston",
      "state":"MA",
      "zip": ""
    },
    "website": "andyfcui",
    "resumedownload":"images/CUIXIANGYU.pdf",
    "social":[

      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/andyfcui/",
        "className":"fa fa-linkedin"
      },

      {
        "name":"github",
        "url":"https://github.com/AndyFCui",
        "className":"fa fa-github"
      },

      {
        "name":"nuwork",
        "url":"https://northeastern-csm.symplicity.com/profiles/xiangyu.cui",
        "className":"fa fa-nuwork"
      }

    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Northeastern University",
        "degree":"Master of Science in Artificial Intelligence",
        "graduated":"Dec 2023",
        "Coursework":"Object-Oriented Design, Natural Language Processing, Game Artificial Intelligence, Machine Learning, Computer/Human Interaction, Algorithm, Wireless Sensor/Internet Things, Deterministic Ops Reaserch, Database Managemen",
        "description":"Relevant Coursework: ",
        "image": "education.jpg",
        "honor": "",
        "awards": ""
      },
      {
        "school":"University of Nebraska Lincoln",
        "degree":"Bachelor of Computer Science",
        "graduated":"May 2020",
        "description":"Relevant Coursework: ",
        "Coursework":"Wireless Communication Networks, Automata Theory, Unix Programming, Discrete Structure, Internet Systems & Programming, VR Programming of Unity, Numerical Analysis, Data Structure & Algorithm, Operating Systems Kernels, Basic Programming",
        "image": "education2.png",
        "honor": "Authentication Place in ICPC ACM 2017 Central American Finals",
        "awards": "Awards:"
      },
      {
        "school":"Dalian Neusoft University of Information",
        "degree":"Eletronic Infomation Engineering",
        "graduated":"July 2015 - Transfered to University of Nebraska Lincoln",
        "description":"Relevant Coursework: ",
        "Coursework":"Embedded System Programming, Sensor & Signal Theory, C Basic Programming, Analog Circuit, Digital Circuit, CAD Engineering Drawing, PCB Design with Auto CAD, TCP/IP Network Programming",
        "image": "education3.png",
        "honor": "1st Prize in Computer Business Entrepreneurship Contest, Winner of 2015 Freescale Smart Car Competition", 
        "awards": "Awards:"
      }
    ],
    "work":[
      {
        "company":"CAC Auto Group LLC",
        "title":"Data Engineer - Full Time",
        "years":"Feb 2024 - Present, Southborough, MA, United States",
        "image":"cacauto.png",
        "description":
        [
        "Develop and maintain a predictive price forecast system for vehicles listed on CarGurus using a serverless architecture on AWS. This system enhances market compatibility for vehicle pricing and optimizes operational efficiency. Leveraged core AWS services such as S3, Lambda, DynamoDB, SNS, CloudWatch, and Kinesis for real-time data processing, with Python as the primary programming language and AWS CloudFormation (YAML) for Infrastructure as Code (IaC).  \n ",
        "Implemented real-time data monitoring using AWS Kinesis to track market data fluctuations, enabling the system to detect and trigger S3 events when vehicle prices deviate from predefined ranges. This near real-time data handling detects discrepancies in vehicle market prices promptly, allowing quick corrective actions to keep vehicle listings competitive and accurate. \n",
        "Established Automated Alert notifications through Amazon SNS and integrated with AWS SQS and Lambda to automatically notify the team when specific events are triggered. This system improved the accuracy and market compatibility of vehicle prices displayed on the company's website, resulting in an 80% boost in daily operational efficiency and over 50% improvement in real-time price adjustments compared to industry standards. \n",
        "Designed and managed a data lake architecture on AWS, incorporating raw, cleansed, and application data layers stored in S3. This data lake supports the BI team with enhanced access to structured data, improving data processing efficiency by 50%. \n",
        "Orchestrated data processing workflows through AWS Step Functions, which automate the execution of multiple Glue Crawlers and ETL jobs to process data and update S3 layers. Enabled continuous monitoring through Glue Data Catalog and Athena to maintain data quality and consistency across all data lake layers. \n",
        "Enhanced infrastructure reliability by using AWS CloudFormation to deploy reproducible infrastructure configurations across environments, which streamlined deployment, reduced development costs by 70%, and supported faster product iteration for an agile startup environment. \n",
        "Automated SNS notifications to alert the team about Glue Crawler or ETL job failures, improving response time and reducing data pipeline downtime by 30%. \n",
        "Implemented a Lambda-based schema change detection system that uses Glue Crawler and Glue Data Catalog to track metadata changes in source data and trigger alert emails for schema inconsistencies. This setup led to a 60% reduction in troubleshooting time and a 50% decrease in data delivery delays. \n",
        "Managed Agile processes for development, participating in Scrum meetings and data pipeline structure design, while maintaining version control through Git and tracking project tasks on Jira. Established a continuous integration pipeline via Bamboo from Bitbucket, ensuring streamlined deployments."
      ]
                
      },
      {
        "company":"AlpaLifeBio Inc",
        "title":"Software Engineer of Data Engineer  - Intership",
        "years":"Dec 2022 - Jun 2023, Woburn, MA, United States",
        "image":"alpalife_logo.jpg",
        "description":
        [
        "Built and managed a robust AWS streaming data pipeline to automate biomedical data ingestion from multiple public databases into Kinesis Data Stream. This system processed over 500,000 data entries daily, using Lambda Functions for real-time data transfer and S3 and DynamoDB for efficient, scalable storage and retrieval. This architecture allowed seamless handling of high-volume data with minimized latency and reduced operational costs.  \n ",
        "Configured and optimized a structured SQL database to integrate and process data from diverse biomedical sources. Implemented an efficient tag-processing system for enhanced search and retrieval operations, reducing data retrieval time by 80%. This improvement significantly boosted operational efficiency, making it easier to access and analyze critical information for downstream applications. \n",
        "Applied advanced data matching algorithms and TF-IDF (Term Frequency-Inverse Document Frequency) techniques to perform data comparison and accurately identify potential client profiles with a 95% match rate. This methodology directly supported targeted marketing strategies by enabling precise identification of high-value clients within the biomedical field. \n",
        "Enabled real-time notifications for data updates by setting up DynamoDB Streams to capture table modifications. Configured Lambda Functions to process these events and send automated alert emails through Amazon SES, enhancing response times by 30% and streamlining the data update workflow."
      ]
                
      },
      {
        "company":"Dutchgo LLC",
        "title":"Software Engineer - Self-employed & Co-founder",
        "years":"Oct 2020 - Apr 2022, Omaha, NE, United States",
        "image":"dutchgo.png",
        "description":
        [
        "Developed a customer demand analysis pipeline during the Covid-19 pandemic using AWS S3 for secure data storage and Lambda for serverless processing, combined with SQL and Python. Built and deployed a Random Forest model on AWS SageMaker to identify high-potential user profiles for conversion, achieving an accuracy of 98%. This automated approach saved considerable processing time and improved prediction accuracy for strategic marketing efforts. \n ",
        "Established a data ingestion and processing framework using AWS Glue to automate data ETL processes, enabling seamless integration of monthly customer market data from S3 into DynamoDB for structured storage. Employed SQL and Python to preprocess data and built a multiple regression model on SageMaker to predict revenue trends, achieving an 85% accuracy rate. This solution provided valuable insights for strategic decision-making regarding resource allocation and customer segmentation. \n",
        "Analyzed user behavior patterns to inform UX design by employing Human-Computer Interaction (HCI) principles. Utilized Axure RP to create interactive software prototypes aligned with user behavior insights. Additionally, used AWS Amplify to deploy and test front-end prototypes rapidly, ensuring seamless integration with back-end data and enhancing user experience. \n",
        "Constructed real-time monitoring dashboards using Tableau to track essential investment metrics, such as ROI (Return on Investment), growth rate, and portfolio balance. Integrated AWS Kinesis for real-time data streaming, enabling prompt anomaly detection and root cause analysis. This system provided stakeholders with actionable insights on data trends, supporting a 30% faster decision-making process for adjusting business strategies. \n",
        "Set up AWS CloudFormation templates to manage and automate infrastructure provisioning, ensuring efficient resource management and scalability of the analysis system. Leveraged AWS IAM to implement robust access control, securing data and model resources across the team."
      ]
                
      },

      {
        "company":"Chatchup(Zhuiguang) Information Technology Co. Ltd",
        "title":"Project Manager & Project Analyst",
        "years":"Jan 2019 - Sept 2020, Henan, Zhengzhou, China",
        "image":"catchup.png",
        "description":
        [
          "Analyzed customer requirements to draft an activity diagram and outlined preliminary UML page functionality scenarios. Initiated the development of customized software (Web & App) tailored to customer needs. \n",
          "Employed advanced SQL queries and Python to analyze over 50GB of market data on similar products, identifying customer usage patterns and business requirements. \n",
          "Conducted exploratory data analysis on numerical, categorical, and time-series data using Matplotlib and Seaborn. Constructed multivariance Time Series Clustering model, DTW (Dynamic Time Warping) with Hierarchical clustering, on 120 features to group customers, segment market and described the clustering centroid by DBA (DTW Barycenter Averaging). \n",
          "Trained market demand models, including Isolation Forest and Robust PCA (Principal Component Analysis), as well as Linear Models and Random Forests, to establish a system for identifying and responding to customers' potential requirements.\n", 
          "Constructed dashboards with Tableau to depict customer usage activities and submitted analytical reports to clients."
        ]
      },
      {
        "company":"Dell Inc",
        "title":"IT Support Specialist",
        "years":"Oct 2013 - Oct 2015, Dalian, LiaoNing, China",
        "image":"dell_logo.jpg",
        "description":
        [
          "Organized on-campus after sales technology support events for Dell products. \n",
          "Improved reports procedures and saved five hours of manual work every week. \n",
          "Managed an average of ten requests daily, creating and updating data elements on the Dell Campus platform."
        ]
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "60%"
      },
      {
        "name": "Python",
        "level": "60%"
      },
      {
        "name": "JavaScript",
        "level": "60%"
      },
      {
        "name": "HTML",
        "level": "60%"
      },
      {
        "name": "CSS",
        "level": "60%"
      },
      {
        "name": "C/C++",
        "level": "60%"
      },
      {
        "name": "Assembly",
        "level": "60%"
      },
      {
        "name": "VB",
        "level": "60%"
      },
      {
        "name": "MySQL",
        "level": "60%"
      },
      {
        "name": "PostgreSQL",
        "level": "60%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "Redis",
        "level": "60%"
      },
      {
        "name": "SQLite",
        "level": "60%"
      },
      {
        "name": "TF-IDF",
        "level": "60%"
      },
      {
        "name": "Naive Bayes",
        "level": "60%"
      },
      {
        "name": "GPT-2",
        "level": "60%"
      },
      {
        "name": "Bert",
        "level": "60%"
      },
      {
        "name": "CNN",
        "level": "60%"
      },
      {
        "name": "Transform",
        "level": "60%"
      },
      {
        "name": "Spring Boot",
        "level": "60%"
      },
      {
        "name": "React.js",
        "level": "60%"
      },
      {
        "name": "Node.js",
        "level": "60%"
      },
      {
        "name": "jQuery",
        "level": "60%"
      },
      {
        "name": "GitHub",
        "level": "60%"
      },
      {
        "name": "TFS",
        "level": "60%"
      },
      {
        "name": "Azure DevOps",
        "level": "60%"
      },
      {
        "name": "Jenkins",
        "level": "60%"
      },
      {
        "name": "Jira",
        "level": "60%"
      },
      {
        "name": "AWS",
        "level": "60%"
      },
      {
        "name": "Docker",
        "level": "60%"
      },
      {
        "name": "Maven",
        "level": "60%"
      },
      {
        "name": "Tomcat",
        "level": "60%"
      },
      {
        "name": "Axure",
        "level": "60%"
      },
      {
        "name": "Servlet",
        "level": "60%"
      },
      {
        "name": "JUnit",
        "level": "60%"
      },
      {
        "name": "Nginx",
        "level": "60%"
      },
      {
        "name": "Office",
        "level": "60%"
      }
    ]
  },
  "portfolio":{
    "projects": [

      {
        "title":"Employment Website Design",
        "category":"– A Web-based Axure based on CRAP interface interaction",
        "description": 
        ["Designed a co-op-focused Employment Website using HCI principles to offer an intuitive experience catering to non-technical users, ensuring broad usability.",
        "Applied CRAP design principles to create a visually cohesive and navigable interface, addressing existing website pain points by incorporating critical features such as visa type and field of work.",
        "Led the unification of UI design across the platform, ensuring a smooth and accessible user experience for a broad audience. Validated design success and user satisfaction with thorough usability testing, confirming high effectiveness and gratification."
        ],
        "image":"EmploymentWebsiteDesign/job_web.png",
        "url":"https://github.com/AndyFCui/HCI_Design_Job_website"
      },
      
      {
        "title":"Amazon QA robot trained by BERT & GPT-2",
        "category":"– Trained amazon toy customers' comment to train a QA robot",
        "description": 
        ["Developed a Question Answering (QA) system using GPT-2 and BERT models focused on Amazon product reviews, assessing their performance in natural language processing tasks.",
        "Applied advanced NLP techniques, including TF-IDF Vectorization, CBOW, and Skip-gram, for effective data preprocessing and analysis.",
        "Conducted K-Fold Cross-Validation and ablation studies to optimize model performance and robustness, utilizing comprehensive model training and fine-tuning with a Kaggle dataset. We focused on accuracy, LOSS, and BLEU score metrics for evaluation, ultimately achieving high precision with an Accuracy F1 score of up to 94%."
      ],
        "image":"amazonQArobot/qaRobot.png",
        "url":"https://github.com/AndyFCui/Amazon_QA_Robot"
      },
      {
        "title":"Online Shop Database",
        "category":"– A online shop database system, deploy by SQL and python.",
        "description": 
        ["Developed a Python and MySQL-based Robot Store Management System to streamline operations for small supermarkets, featured in a terminal user interface.",
        "Implemented SQL database structures and Python-MySQL connections, enabling efficient user account, order, and refund management.",
        "Constructed and documented a secure, offline management system, accommodating customer and operator interactions with potential for web expansion using Django.",
        "Managed project version control with Anaconda and maintained code repository on GitHub, with comprehensive end-user documentation and test cases."
        ],
        "image":"onlineDatabase/onlineDatabase.png",
        "url":"https://github.com/AndyFCui/OnlineShop-Database"
      },
      {
        "title":"Crash Loyal AI Agent collision method",
        "category":"– An AI agent's collision method implemented Crash Loyalty game",
        "description": 
        ["Implemented character behavior logic that prioritizes enemy engagements and tactical decisions, ensuring actions adhere to game rationality and strategy.",
        "Conducted thorough testing and debugging to maintain game balance and performance, ensuring characters operate within defined routes and adhere to game boundaries.",
        "Orchestrated a dynamic unit deployment and resource management mechanic, incorporating a strategic elixir accumulation system for gameplay depth.",
        "Managed project documentation and version control, ensuring robust testing and functionality within the set development timeframe."
        ],
        "image":"aiAgent_CrashLoyal/aiAgent.png",
        "url":"https://github.com/AndyFCui/CrashLoyal_AI_agent"
      },
      {
        "title":"Doctor Lucky java Jframe game",
        "category":"– An OOD use MVC implemented by java Jframe game",
        "description": 
        ["Implemented character behavior logic that prioritizes enemy engagements and tactical decisions, ensuring actions adhere to game rationality and strategy.",
        "Conducted thorough testing and debugging to maintain game balance and performance, ensuring characters operate within defined routes and adhere to game boundaries.",
        "Orchestrated a dynamic unit deployment and resource management mechanic, incorporating a strategic elixir accumulation system for gameplay depth.",
        "Managed project documentation and version control, ensuring robust testing and functionality within the set development timeframe."
        ],
        "image":"doctorLucky/doctorLucky.png",
        "url":"https://github.com/AndyFCui/DuctorLuctorMVC"
      },
      {
        "title":"Gobang AI Game Agent",
        "category":"– An alpha-beta AI Agent implemented with Bobang",
        "description": 
        ["Implemented a Gobang AI agent leveraging alpha-beta pruning to calculate stepwise rewards, enabling the agent to strategically discard less rewarding moves for enhanced gameplay efficacy.",
        "Architected predefined Gobang chess strategies with assigned value metrics, which were intricately incorporated into the AI's decision-making process, augmenting the competitiveness of the agent.",
        "Synthesized traditional Gobang tactics with algorithmic precision, optimizing the AI's play style to reflect a deep understanding of the game's cultural strategy elements."
        ],
        "image":"goBang_agent/goBang.png",
        "url":"https://github.com/AndyFCui/Gobang_AI_Agent__alphaBetaa"
      }
    ]
  }
  
}
