{
  "main": {
    "name":"Andy (Xiang-Yu) Cui",
    "occupation":"  Artificial Intelligence Master Student of Khoury College in Northeastern University (Boston)",
    "description":"Actively Seeking for SDE/DS/ML Roles | MSCS-AI NEU 23' Dec | F1-OPT Sponsor Required",
    "image":"profilepic.jpg",
    "intro":"Actively Seeking for SDE/DS/ML Roles | MSCS-AI NEU 23' Dec | F1-OPT Sponsor Required ",
    "bio":"Integrating state-of-the-art design and development practices, I specialize in creating robust Machine Learning, back-end, and front-end applications, having delivered multifaceted projects across diverse domains. My technical toolkit is comprehensive, encompassing Java, Python, MySQL, PostgreSQL, AWS, React.js, and adept implementation of CI/CD pipelines. Mastering complex problem-solving, I am a self-driven technophile, relentlessly chasing the latest technological breakthroughs. As a fervent learner in Machine Learning and Natural Language Processing, I am particularly captivated by the prospects of mining cutting-edge big data and transforming it into insightful visual representations.",
    "skills": [
      "Programing languages: Java, Python, JavaScript, HTML, CSS, C/C++, Assembly, VB",
      "Database: MySQL, PostgreSQL, MongoDB, Redis, SQLite, Hive",
      "Machine Learning: TF-IDF, Naïve Bayes, GPT-2, Bert, CNN, Transformer",
      "Framework/Libraries: Spring Boot, React.js, Node.js, jQuery",
      "Version Control & CI/CD: GitHub, TFS, Azure DevOps, Jenkins, Jira",
      "Others: AWS, Docker, Maven, Tomcat, Axure, Servlet, Junit, Nginx, LaTeX, CAD design, Tableau"
    ],
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "xiangyucui@outlook.com  cui.xiangyu@northeastern.edu",
    "phone": "(402)-853-3000",
    "city":"Boston",
    "nameUnderImage": "Andy    Cui",
    "address":{
      "street":"",
      "city":"Boston",
      "state":"MA",
      "zip": ""
    },
    "website": "andyfcui",
    "resumedownload":"images/CUIXIANGYU.pdf",
    "social":[

      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/andyfcui/",
        "className":"fa fa-linkedin"
      },

      {
        "name":"github",
        "url":"https://github.com/AndyFCui",
        "className":"fa fa-github"
      },

      {
        "name":"nuwork",
        "url":"https://northeastern-csm.symplicity.com/profiles/xiangyu.cui",
        "className":"fa fa-nuwork"
      }

    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Northeastern University",
        "degree":"Master of Science in Artificial Intelligence",
        "graduated":"Dec 2023",
        "Coursework":"Object-Oriented Design, Natural Language Processing, Game Artificial Intelligence, Machine Learning, Computer/Human Interaction, Algorithm, Wireless Sensor/Internet Things, Deterministic Ops Reaserch, Database Managemen",
        "description":"Relevant Coursework: ",
        "image": "education.jpg",
        "honor": "",
        "awards": ""
      },
      {
        "school":"University of Nebraska Lincoln",
        "degree":"Bachelor of Computer Science",
        "graduated":"May 2020",
        "description":"Relevant Coursework: ",
        "Coursework":"Wireless Communication Networks, Automata Theory, Unix Programming, Discrete Structure, Internet Systems & Programming, VR Programming of Unity, Numerical Analysis, Data Structure & Algorithm, Operating Systems Kernels, Basic Programming",
        "image": "education2.png",
        "honor": "Authentication Place in ICPC ACM 2017 Central American Finals",
        "awards": "Awards:"
      },
      {
        "school":"Dalian Neusoft University of Information",
        "degree":"Eletronic Infomation Engineering",
        "graduated":"July 2015 - Transfered to University of Nebraska Lincoln",
        "description":"Relevant Coursework: ",
        "Coursework":"Embeded System Proramming, Sensor & Signal Theory, C Basic Programming, Analog Circuit, Digital Circuit, CAD Engineering Drawing, PCB Design with Auto CAD, TCP/IP Network Programming",
        "image": "education3.png",
        "honor": "1st Prize in Computer Business Entrepreneurship Contest, Winner of 2015 Freescale Smart Car Competition", 
        "awards": "Awards:"
      }
    ],
    "work":[
      {
        "company":"AlpaLifeBio Inc",
        "title":"Software Engineer & Data Analyst - Intership",
        "years":"Dec 2022 - Jun 2023, Woburn, MA, United States",
        "image":"alpalife_logo.jpg",
        "description":
        [
        "Executed data collection from biomedical public databases using Python and graphical web scraping tools, enhancing the dataset for advanced analysis. Additionally, processed and analyzed over 500,000 data entries daily, utilizing graphical data representations to streamline reporting and significantly boost workflow efficiency.  \n ",
        "Applied TF-IDF techniques for data comparison and matching, effectively identifying potential clients with a match rate of up to 95%, significantly contributing to targeted marketing strategies. \n",
        "Consolidated existing datasets for integrated analysis and established a structured SQL database, implementing tag processing for improved search and retrieval operations. This approach has saved 80% of the time for future data searches and significantly enhanced work efficiency, thereby saving costs for the company. \n"
      ]
                
      },
      {
        "company":"Dutchgo LLC",
        "title":"Software Engineer Leader - Self-employed/CEO",
        "years":"Oct 2020 - Apr 2022, Omaha, NE, United States",
        "image":"dutchgo.png",
        "description":
        [
        "Spearheaded the team in analyzing market conditions, conducted investigative analytics on Netflix user data to develop similar products, enhancing competitive market positioning. \n ",
        "Employed web scraping technologies to aggregate and statistically analyze over 80 million data points across the web, employing graphical data flow techniques for targeted user demographic analysis.\n",
        "Led product development initiatives that generated $3 million in revenue, employing daily data analysis to inform strategies and rapidly deploy solutions, significantly contributing to the company’s operational efficiency.\n",
        "Implemented process controls to ensure precision in the deployment of all development stages and work segments, resulting in a marked efficiency improvement in a small company setting."
      ]
                
      },
      {
        "company":"Dell Inc",
        "title":"IT Support Specialist",
        "years":"Oct 2013 - Oct 2015, Dalian, LiaoNing, China",
        "image":"dell_logo.jpg",
        "description":
        [" Organized on-campus after sales technology support events for Dell products. \n",
          "Improved reports procedures and saved five hours of manual work every week. \n",
          "Managed an average of ten requests daily, creating and updating data elements on the Dell Campus platform."
        ]
      }
    ],
    "skills": [
      {
        "name": "Java",
        "level": "60%"
      },
      {
        "name": "Python",
        "level": "60%"
      },
      {
        "name": "JavaScript",
        "level": "60%"
      },
      {
        "name": "HTML",
        "level": "60%"
      },
      {
        "name": "CSS",
        "level": "60%"
      },
      {
        "name": "C/C++",
        "level": "60%"
      },
      {
        "name": "Assembly",
        "level": "60%"
      },
      {
        "name": "VB",
        "level": "60%"
      },
      {
        "name": "MySQL",
        "level": "60%"
      },
      {
        "name": "PostgreSQL",
        "level": "60%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "Redis",
        "level": "60%"
      },
      {
        "name": "SQLite",
        "level": "60%"
      },
      {
        "name": "TF-IDF",
        "level": "60%"
      },
      {
        "name": "Naive Bayes",
        "level": "60%"
      },
      {
        "name": "GPT-2",
        "level": "60%"
      },
      {
        "name": "Bert",
        "level": "60%"
      },
      {
        "name": "CNN",
        "level": "60%"
      },
      {
        "name": "Transform",
        "level": "60%"
      },
      {
        "name": "Spring Boot",
        "level": "60%"
      },
      {
        "name": "React.js",
        "level": "60%"
      },
      {
        "name": "Node.js",
        "level": "60%"
      },
      {
        "name": "jQuery",
        "level": "60%"
      },
      {
        "name": "GitHub",
        "level": "60%"
      },
      {
        "name": "TFS",
        "level": "60%"
      },
      {
        "name": "Azure DevOps",
        "level": "60%"
      },
      {
        "name": "Jenkins",
        "level": "60%"
      },
      {
        "name": "Jira",
        "level": "60%"
      },
      {
        "name": "AWS",
        "level": "60%"
      },
      {
        "name": "Docker",
        "level": "60%"
      },
      {
        "name": "Maven",
        "level": "60%"
      },
      {
        "name": "Tomcat",
        "level": "60%"
      },
      {
        "name": "Axure",
        "level": "60%"
      },
      {
        "name": "Servlet",
        "level": "60%"
      },
      {
        "name": "JUnit",
        "level": "60%"
      },
      {
        "name": "Nginx",
        "level": "60%"
      },
      {
        "name": "Office",
        "level": "60%"
      }
    ]
  },
  "portfolio":{
    "projects": [

      {
        "title":"Employment Website Design",
        "category":"– A Web-based Axure based on CRAP interface interaction",
        "description": 
        ["Designed a co-op-focused Employment Website using HCI principles to offer an intuitive experience catering to non-technical users, ensuring broad usability.",
        "Applied CRAP design principles to create a visually cohesive and navigable interface, addressing existing website pain points by incorporating critical features such as visa type and field of work.",
        "Led the unification of UI design across the platform, ensuring a smooth and accessible user experience for a broad audience. Validated design success and user satisfaction with thorough usability testing, confirming high effectiveness and gratification."
        ],
        "image":"EmploymentWebsiteDesign/job_web.png",
        "url":"https://github.com/AndyFCui/HCI_Design_Job_website"
      },
      
      {
        "title":"Amazon QA robot trained by BERT & GPT-2",
        "category":"– Trained amazon toy customers' comment to train a QA robot",
        "description": 
        ["Developed a Question Answering (QA) system using GPT-2 and BERT models focused on Amazon product reviews, assessing their performance in natural language processing tasks.",
        "Applied advanced NLP techniques, including TF-IDF Vectorization, CBOW, and Skip-gram, for effective data preprocessing and analysis.",
        "Conducted K-Fold Cross-Validation and ablation studies to optimize model performance and robustness, utilizing comprehensive model training and fine-tuning with a Kaggle dataset. We focused on accuracy, LOSS, and BLEU score metrics for evaluation, ultimately achieving high precision with an Accuracy F1 score of up to 94%."
      ],
        "image":"amazonQArobot/qaRobot.png",
        "url":"https://github.com/AndyFCui/Amazon_QA_Robot"
      },
      {
        "title":"Online Shop Database",
        "category":"– A online shop database system, deploy by SQL and python.",
        "description": 
        ["Developed a Python and MySQL-based Robot Store Management System to streamline operations for small supermarkets, featured in a terminal user interface.",
        "Implemented SQL database structures and Python-MySQL connections, enabling efficient user account, order, and refund management.",
        "Constructed and documented a secure, offline management system, accommodating customer and operator interactions with potential for web expansion using Django.",
        "Managed project version control with Anaconda and maintained code repository on GitHub, with comprehensive end-user documentation and test cases."
        ],
        "image":"onlineDatabase/onlineDatabase.png",
        "url":"https://github.com/AndyFCui/OnlineShop-Database"
      },
      {
        "title":"Crash Loyal AI Agent collision method",
        "category":"– An AI agent's collision method implemented Crash Loyalty game",
        "description": 
        ["Implemented character behavior logic that prioritizes enemy engagements and tactical decisions, ensuring actions adhere to game rationality and strategy.",
        "Conducted thorough testing and debugging to maintain game balance and performance, ensuring characters operate within defined routes and adhere to game boundaries.",
        "Orchestrated a dynamic unit deployment and resource management mechanic, incorporating a strategic elixir accumulation system for gameplay depth.",
        "Managed project documentation and version control, ensuring robust testing and functionality within the set development timeframe."
        ],
        "image":"aiAgent_CrashLoyal/aiAgent.png",
        "url":"https://github.com/AndyFCui/CrashLoyal_AI_agent"
      },
      {
        "title":"Doctor Lucky java Jframe game",
        "category":"– An OOD use MVC implemented by java Jframe game",
        "description": 
        ["Implemented character behavior logic that prioritizes enemy engagements and tactical decisions, ensuring actions adhere to game rationality and strategy.",
        "Conducted thorough testing and debugging to maintain game balance and performance, ensuring characters operate within defined routes and adhere to game boundaries.",
        "Orchestrated a dynamic unit deployment and resource management mechanic, incorporating a strategic elixir accumulation system for gameplay depth.",
        "Managed project documentation and version control, ensuring robust testing and functionality within the set development timeframe."
        ],
        "image":"doctorLucky/doctorLucky.png",
        "url":"https://github.com/AndyFCui/DuctorLuctorMVC"
      },
      {
        "title":"Gobang AI Game Agent",
        "category":"– An alpha-beta AI Agent implemented with Bobang",
        "description": 
        ["Implemented a Gobang AI agent leveraging alpha-beta pruning to calculate stepwise rewards, enabling the agent to strategically discard less rewarding moves for enhanced gameplay efficacy.",
        "Architected predefined Gobang chess strategies with assigned value metrics, which were intricately incorporated into the AI's decision-making process, augmenting the competitiveness of the agent.",
        "Synthesized traditional Gobang tactics with algorithmic precision, optimizing the AI's play style to reflect a deep understanding of the game's cultural strategy elements."
        ],
        "image":"goBang_agent/goBang.png",
        "url":"https://github.com/AndyFCui/Gobang_AI_Agent__alphaBetaa"
      }
    ]
  }
  
}
